In [42]:
## Dependencies and setup
import pandas as pd
import numpy as np

In [43]:
## Load data files
veg_p_and_h = "../../1_Extract/USDA-Vegetable_2017-2019/veg_plant_and_harvest_xstate_2017-2019.csv"

In [44]:
## Read data and store into df
## Drop the first 3 rows which hold info text
veg_p_and_h = pd.read_csv(veg_p_and_h, skiprows=3)
veg_p_and_h

,324,h,Unnamed: 2,Area planted,Area planted.1,Area planted.2,Area harvested,Area harvested.1,Area harvested.2
0,324,h,State,NaN,NaN,NaN,NaN,NaN,NaN
1,324,h,NaN,2017 1/,2018 1/,2019 2/,2017 1/,2018 1/,2019 2/
2,324,h,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,324,u,NaN,(acres),(acres),(acres),(acres),(acres),(acres)
4,324,d,Alabama 3/,5600,6000,(NA),5400,5900,(NA)
5,324,d,Arizona,129900,(D),124300,127000,(D),123900
6,324,d,California 4/,1059100,999400,985600,1039900,985800,972400
7,324,d,Colorado,(D),(D),3200,(D),(D),2700
8,324,d,Delaware 3/,(D),(D),(NA),(D),(D),(NA)
9,324,d,Florida 4/,178700,180000,175500,172700,172800,170700
10,324,d,Georgia,97100,102900,96600,91900,95400,92900
11,324,d,Idaho,16700,12600,11000,16400,12300,10900
12,324,d,Illinois,48800,40900,43100,46100,38850,38100
13,324,d,Indiana,28500,29200,11700,27800,28000,11100
14,324,d,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,324,d,Maryland 3/,(D),(D),(NA),(D),(D),(NA)
16,324,d,Michigan,110800,107700,90100,107500,101900,87200
17,324,d,Minnesota,176800,171000,160500,165100,160600,154300
18,324,d,Mississippi 4/,-,-,28000,-,-,27500
19,324,d,Missouri 3/,3100,(D),(NA),3000,(D),(NA)
20,324,d,New Jersey,30000,30300,11200,28800,28500,10600
21,324,d,New Mexico,15400,15600,15700,14700,15000,15300
22,324,d,New York,94300,97700,90100,90100,89200,86300
23,324,d,North Carolina 4/,38300,40700,127700,37300,36500,126300
24,324,d,Ohio,22200,22700,3700,21300,21500,3500
25,324,d,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,324,d,Oregon,(D),(D),80700,(D),(D),79000
27,324,d,Pennsylvania,29300,30500,14700,27650,25500,13500
28,324,d,South Carolina,(D),10700,5000,(D),10300,4500
29,324,d,Tennessee 3/,11700,13800,(NA),11300,12700,(NA)
30,324,d,Texas,73700,67500,54000,67600,62000,50100
31,324,d,Virginia,6250,8300,5700,6000,7500,5600
32,324,d,Washington,160400,147700,144900,154300,144100,140300
33,324,d,Wisconsin,(D),(D),164300,(D),(D),155900
34,324,d,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35,324,d,Other States 5/,323050,445250,-,310630,430750,-
36,324,d,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37,324,d,United States,2659700,2580450,2447300,2572480,2485100,2382600
38,324,c,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39,324,c,See footnote(s) at end of table.,--continued,NaN,NaN,NaN,NaN,NaN

In [45]:
## Drop erroneous first 2 columns and non-2019 data
veg_p_and_h.drop(veg_p_and_h.iloc[:, [0, 1, 3, 4, 6, 7]], axis = 1, inplace = True)

## Drop erroneous last few rows
#veg_p_and_h.drop(veg_p_and_h.index[56:66])

veg_p_and_h.head()

   Unnamed: 2 Area planted.2 Area harvested.2
0       State            NaN              NaN
1         NaN        2019 2/          2019 2/
2         NaN            NaN              NaN
3         NaN        (acres)          (acres)
4  Alabama 3/           (NA)             (NA)

In [46]:
## Rename columns
veg_p_and_h = veg_p_and_h.rename(columns={
    "Unnamed: 2": "state",
    "Area planted.2": "area_planted(acres)",
    "Area harvested.2": "area_harvested(acres)"
})

veg_p_and_h.head()

        state area_planted(acres) area_harvested(acres)
0       State                 NaN                   NaN
1         NaN             2019 2/               2019 2/
2         NaN                 NaN                   NaN
3         NaN             (acres)               (acres)
4  Alabama 3/                (NA)                  (NA)

In [47]:
## Drop blank rows
veg_p_and_h = veg_p_and_h.dropna()
veg_p_and_h.head()

           state area_planted(acres) area_harvested(acres)
4     Alabama 3/                (NA)                  (NA)
5        Arizona              124300                123900
6  California 4/              985600                972400
7       Colorado                3200                  2700
8    Delaware 3/                (NA)                  (NA)

In [48]:
## Reset the index
veg_p_and_h = veg_p_and_h.reset_index(drop = True)
veg_p_and_h

                state area_planted(acres) area_harvested(acres)
0          Alabama 3/                (NA)                  (NA)
1             Arizona              124300                123900
2       California 4/              985600                972400
3            Colorado                3200                  2700
4         Delaware 3/                (NA)                  (NA)
5          Florida 4/              175500                170700
6             Georgia               96600                 92900
7               Idaho               11000                 10900
8            Illinois               43100                 38100
9             Indiana               11700                 11100
10        Maryland 3/                (NA)                  (NA)
11           Michigan               90100                 87200
12          Minnesota              160500                154300
13     Mississippi 4/               28000                 27500
14        Missouri 3/                (NA)                  (NA)
15         New Jersey               11200                 10600
16         New Mexico               15700                 15300
17           New York               90100                 86300
18  North Carolina 4/              127700                126300
19               Ohio                3700                  3500
20             Oregon               80700                 79000
21       Pennsylvania               14700                 13500
22     South Carolina                5000                  4500
23       Tennessee 3/                (NA)                  (NA)
24              Texas               54000                 50100
25           Virginia                5700                  5600
26         Washington              144900                140300
27          Wisconsin              164300                155900
28    Other States 5/                   -                     -
29      United States             2447300               2382600

In [49]:
## Replace (NA) and "-" with None
veg_p_and_h = veg_p_and_h.replace({'(NA)': None})
veg_p_and_h = veg_p_and_h.replace({'-': None})
veg_p_and_h

                state area_planted(acres) area_harvested(acres)
0          Alabama 3/                None                  None
1             Arizona              124300                123900
2       California 4/              985600                972400
3            Colorado                3200                  2700
4         Delaware 3/                None                  None
5          Florida 4/              175500                170700
6             Georgia               96600                 92900
7               Idaho               11000                 10900
8            Illinois               43100                 38100
9             Indiana               11700                 11100
10        Maryland 3/                None                  None
11           Michigan               90100                 87200
12          Minnesota              160500                154300
13     Mississippi 4/               28000                 27500
14        Missouri 3/                None                  None
15         New Jersey               11200                 10600
16         New Mexico               15700                 15300
17           New York               90100                 86300
18  North Carolina 4/              127700                126300
19               Ohio                3700                  3500
20             Oregon               80700                 79000
21       Pennsylvania               14700                 13500
22     South Carolina                5000                  4500
23       Tennessee 3/                None                  None
24              Texas               54000                 50100
25           Virginia                5700                  5600
26         Washington              144900                140300
27          Wisconsin              164300                155900
28    Other States 5/                None                  None
29      United States             2447300               2382600

In [50]:
## Remove erroenous text from col "state"
veg_p_and_h = veg_p_and_h.replace(' 3/', '', regex=True)
veg_p_and_h = veg_p_and_h.replace(' 4/', '', regex=True)
veg_p_and_h = veg_p_and_h.replace(' 5/', '', regex=True)
veg_p_and_h

             state area_planted(acres) area_harvested(acres)
0          Alabama                None                  None
1          Arizona              124300                123900
2       California              985600                972400
3         Colorado                3200                  2700
4         Delaware                None                  None
5          Florida              175500                170700
6          Georgia               96600                 92900
7            Idaho               11000                 10900
8         Illinois               43100                 38100
9          Indiana               11700                 11100
10        Maryland                None                  None
11        Michigan               90100                 87200
12       Minnesota              160500                154300
13     Mississippi               28000                 27500
14        Missouri                None                  None
15      New Jersey               11200                 10600
16      New Mexico               15700                 15300
17        New York               90100                 86300
18  North Carolina              127700                126300
19            Ohio                3700                  3500
20          Oregon               80700                 79000
21    Pennsylvania               14700                 13500
22  South Carolina                5000                  4500
23       Tennessee                None                  None
24           Texas               54000                 50100
25        Virginia                5700                  5600
26      Washington              144900                140300
27       Wisconsin              164300                155900
28    Other States                None                  None
29   United States             2447300               2382600

In [51]:
veg_p_and_h["area_planted(acres)"] = pd.to_numeric(veg_p_and_h["area_planted(acres)"])
veg_p_and_h["area_harvested(acres)"] = pd.to_numeric(veg_p_and_h["area_harvested(acres)"])

veg_p_and_h["pct_harvest_success(acres)"] = round(veg_p_and_h["area_harvested(acres)"] / veg_p_and_h["area_planted(acres)"], 2)
veg_p_and_h

,state,area_planted(acres),area_harvested(acres),pct_harvest_success(acres)
0,Alabama,NaN,NaN,NaN
1,Arizona,124300.0,123900.0,1.00
2,California,985600.0,972400.0,0.99
3,Colorado,3200.0,2700.0,0.84
4,Delaware,NaN,NaN,NaN
5,Florida,175500.0,170700.0,0.97
6,Georgia,96600.0,92900.0,0.96
7,Idaho,11000.0,10900.0,0.99
8,Illinois,43100.0,38100.0,0.88
9,Indiana,11700.0,11100.0,0.95
10,Maryland,NaN,NaN,NaN
11,Michigan,90100.0,87200.0,0.97
12,Minnesota,160500.0,154300.0,0.96
13,Mississippi,28000.0,27500.0,0.98
14,Missouri,NaN,NaN,NaN
15,New Jersey,11200.0,10600.0,0.95
16,New Mexico,15700.0,15300.0,0.97
17,New York,90100.0,86300.0,0.96
18,North Carolina,127700.0,126300.0,0.99
19,Ohio,3700.0,3500.0,0.95
20,Oregon,80700.0,79000.0,0.98
21,Pennsylvania,14700.0,13500.0,0.92
22,South Carolina,5000.0,4500.0,0.90
23,Tennessee,NaN,NaN,NaN
24,Texas,54000.0,50100.0,0.93
25,Virginia,5700.0,5600.0,0.98
26,Washington,144900.0,140300.0,0.97
27,Wisconsin,164300.0,155900.0,0.95
28,Other States,NaN,NaN,NaN
29,United States,2447300.0,2382600.0,0.97

In [52]:
veg_p_and_h.to_csv("../veg_plant_and_harvest_19.csv", index=False)